Revit 2027 API
ParameterTypeId.PlumbingFixturesHwConnection Property
 "HW Connection"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PlumbingFixturesHwConnection { get; }
Public Shared ReadOnly Property PlumbingFixturesHwConnection As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PlumbingFixturesHwConnection {
	ForgeTypeId^ get ();
}
static member PlumbingFixturesHwConnection : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace